tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeHiddenUInt(const char* name, uint32_t value) {
    Esp32BaseWeb::sendChunk("<input type='hidden' name='");
    Esp32BaseWeb::sendChunk(name);
    Esp32BaseWeb::sendChunk("' value='");
    writeUInt(value);
    Esp32BaseWeb::sendChunk("'>");
}

void writeRedirectInput(const char* path) {
    Esp32BaseWeb::sendChunk("<input type='hidden' name='redirect' value='");
    Esp32BaseWeb::writeHtmlEscaped(path);
    Esp32BaseWeb::sendChunk("'>");
}

void beginPostForm(const char* action, const char* confirmText, const char* redirectPath, bool editForm) {
    Esp32BaseWeb::sendChunk("<form");
    if (editForm) {
        Esp32BaseWeb::sendChunk(" class='editform'");
    }
    Esp32BaseWeb::sendChunk(" method='post' action='");
    Esp32BaseWeb::sendChunk(action);
    Esp32BaseWeb::sendChunk("' onsubmit=\"return confirm('");
    Esp32BaseWeb::sendChunk(confirmText);
    Esp32BaseWeb::sendChunk("')\">");
    if (redirectPath) {
        writeRedirectInput(redirectPath);
    }
}

void writeSubmit(const char* label, const char* cssClass) {
    Esp32BaseWeb::sendChunk("<input type='submit'");
    if (cssClass) {
        Esp32BaseWeb::sendChunk(" class='");
        Esp32BaseWeb::sendChunk(cssClass);
        Esp32BaseWeb::sendChunk("'");
    }
    Esp32BaseWeb::sendChunk(" value='");
    Esp32BaseWeb::writeHtmlEscaped(label);
    Esp32BaseWeb::sendChunk("'>");
}

void writeTextField(const char* label, const char* name, const char* value, const char* cssClass = "med", uint8_t maxLen = Irrigation::NameMaxBytes - 1) {
    Esp32BaseWeb::sendChunk("<label class='field ");
    Esp32BaseWeb::sendChunk(cssClass);
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::writeHtmlEscaped(label);
    Esp32BaseWeb::sendChunk("<input name='");
    Esp32BaseWeb::sendChunk(name);
    Esp32BaseWeb::sendChunk("' maxlength='");
    writeUInt(maxLen);
    Esp32BaseWeb::sendChunk("' value='");
    Esp32BaseWeb::writeHtmlEscaped(value ? value : "");
    Esp32BaseWeb::sendChunk("'></label>");
}

void writeNumberField(const char* label, const char* name, int32_t value, const char* cssClass = "short") {
    Esp32BaseWeb::sendChunk("<label class='field ");
    Esp32BaseWeb::sendChunk(cssClass);
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::writeHtmlEscaped(label);
    writeNumberInput(name, value);
    Esp32BaseWeb::sendChunk("</label>");
}

void writeCheckboxField(const char* label, const char* name, bool checked) {
    Esp32BaseWeb::sendChunk("<label class='field short'><input type='checkbox' name='");
    Esp32BaseWeb::sendChunk(name);
    Esp32BaseWeb::sendChunk("' value='1'");
    writeChecked(checked);
    Esp32BaseWeb::sendChunk("> ");
    Esp32BaseWeb::writeHtmlEscaped(label);
    Esp32BaseWeb::sendChunk("</label>");
}

void writeFlowSelectField(uint8_t currentFlowId) {
    Esp32BaseWeb::sendChunk("<label class='field short'>Flow<select name='flowId'>");
    for (uint8_t flowId = 1; flowId <= Irrigation::MaxFlowMeters; ++flowId) {
        Esp32BaseWeb::sendChunk("<option value='");
        writeUInt(flowId);
        Esp32BaseWeb::sendChunk("'");
        if (flowId == currentFlowId) {
            Esp32BaseWeb::sendChunk(" selected");
        }
        Esp32BaseWeb::sendChunk(">Flow ");
        writeUInt(flowId);
        Esp32BaseWeb::sendChunk("</option>");
    }
    Esp32BaseWeb::sendChunk("</select></label>");
}

void writeTimeText(uint8_t hour, uint8_t minute) {
    writeUInt(hour);
    Esp32BaseWeb::sendChunk(":");
    if (minute < 10) {
        Esp32BaseWeb::sendChunk("0");
    }
    writeUInt(minute);
}

void writePlanEditForm(uint8_t zoneId, const Irrigation::PlanDefinition& plan, uint32_t defaultYmd) {
    beginPostForm("/api/v1/plans/save", "确认保存计划？", "/irrigation/plans", true);
    if (plan.exists) {
        writeHiddenUInt("planId", plan.planId);
    }
    writeHiddenUInt("zoneId", zoneId);
    writeHiddenUInt("slotIndex", plan.slotIndex);
    Esp32BaseWeb::sendChunk("<input type='hidden' name='enabledPresent' value='1'><div class='fieldgrid'>");
    writeTextField("名称", "name", plan.exists ? plan.name : "计划", "med");
    writeCheckboxField("启用", "enabled", plan.exists && plan.enabled);
    writeNumberField("时", "timeHour", plan.exists ? plan.timeHour : 7, "short");
    writeNumberField("分", "timeMinute", plan.exists ? plan.timeMinute : 0, "short");
    writeNumberField("时长秒", "durationSec", plan.exists ? static_cast<int32_t>(plan.durationSec) : 300, "med");
    writeNumberField("循环天", "cycleDays", plan.exists ? plan.cycleDays : 1, "short");
    writeNumberField("循环掩码", "cycleMask", plan.exists ? static_cast<int32_t>(plan.cycleMask) : 1, "med");
    writeNumberField("起始日期", "cycleStartYmd", plan.exists ? static_cast<int32_t>(plan.cycleStartYmd) : static_cast<int32_t>(defaultYmd), "med");
    Esp32BaseWeb::sendChunk("</div><div class='actions'>");
    writeSubmit("保存");
    Esp32BaseWeb::sendChunk("</div></form>");
    if (plan.exists) {
        Esp32BaseWeb::sendChunk("<div class='actions'>");
        beginPostForm("/api/v1/plans/delete", "确认删除计划？", "/irrigation/plans");
        writeHiddenUInt("planId", plan.planId);
        writeSubmit("删除", "danger");
        Esp32BaseWeb::sendChunk("</form></div>");
    }
}

void handleFlowsPage() {
    Esp32BaseWeb::sendHeader("Flows");
    Esp32BaseWeb::sendPageTitle("Flows", "流量计配置与 K+Offset 校准参数");
    for (uint8_t flowId = 1; flowId <= Irrigation::MaxFlowMeters; ++flowId) {
        const Irrigation::FlowMeterConfig& flow = FlowConfigStore::get(flowId);
        const Irrigation::FlowMeterCalibrationProfile& active = flow.activeCalibration;
        Esp32BaseWeb::beginPanel("Flow 配置");
        Esp32BaseWeb::sendChunk("<h3>Flow ");
        writeUInt(flowId);
        Esp32BaseWeb::sendChunk("</h3><div class='tablewrap'><table class='kv'><tbody><tr><th>脉冲 GPIO</th><td>");
        writeUInt(flow.pulsePin);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>状态</th><td>");
        Esp32BaseWeb::sendChunk(flow.enabled ? "enabled" : "disabled");
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>Active</th><td>K=");
        writeInt(active.kUlPerMinPerHz);
        Esp32BaseWeb::sendChunk(" ul/min/Hz, offset=");
        writeInt(active.offsetMilliHz);
        Esp32BaseWeb::sendChunk(" milliHz</td></tr><tr><th>Pending</th><td>");
        if (flow.hasPendingCalibration) {
            Esp32BaseWeb::sendChunk("K=");
            writeInt(flow.pendingCalibration.kUlPerMinPerHz);
            Esp32BaseWeb::sendChunk(" ul/min/Hz, offset=");
            writeInt(flow.pendingCalibration.offsetMilliHz);
            Esp32BaseWeb::sendChunk(" milliHz");
        } else {
            Esp32BaseWeb::sendChunk("-");
        }
        Esp32BaseWeb::sendChunk("</td></tr></tbody></table></div>");
        beginPostForm("/api/v1/flows/config", "确认保存 Flow 配置？", "/irrigation/flows", true);
        writeHiddenUInt("flowId", flowId);
        Esp32BaseWeb::sendChunk("<input type='hidden' name='enabledPresent' value='1'><div class='fieldgrid'>");
        writeCheckboxField("启用", "enabled", flow.enabled);
        writeNumberField("K", "kUlPerMinPerHz", active.kUlPerMinPerHz, "med");
        writeNumberField("Offset(mHz)", "offsetMilliHz", active.offsetMilliHz, "med");
        writeNumberField("低频提示(mHz)", "warningFreqMilliHz", static_cast<int32_t>(active.warningFreqMilliHz), "med");
        writeNumberField("有效下限(mHz)", "minValidFreqMilliHz", static_cast<int32_t>(active.minValidFreqMilliHz), "med");
        writeNumberField("有效上限(mHz)", "maxValidFreqMilliHz", static_cast<int32_t>(active.maxValidFreqMilliHz), "med");
        writeNumberField("稳压秒", "pressurizeSec", active.pressurizeSec, "short");
        writeNumberField("采样秒", "sampleWindowSec", active.sampleWindowSec, "short");
        Esp32BaseWeb::sendChunk("</div><div class='actions'>");
        writeSubmit("保存为 pending");
        Esp32BaseWeb::sendChunk("</div></form><div class='actions'>");
        beginPostForm("/api/v1/calibration/pending/apply", "确认应用 pending 校准？", "/irrigation/flows");
        writeHiddenUInt("flowId", flowId);
        writeSubmit("应用 pending", "secondary");
        Esp32BaseWeb::sendChunk("</form>");
        beginPostForm("/api/v1/calibration/rollback/restore", "确认回滚上一套校准？", "/irrigation/flows");
        writeHiddenUInt("flowId", flowId);
        writeSubmit("回滚", "secondary");
        Esp32BaseWeb::sendChunk("</form></div>");
        Esp32BaseWeb::endPanel();
    }
    Esp32BaseWeb::sendFooter();
}

