tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void handleZonesPage() {
    Esp32BaseWeb::sendHeader("Zones");
    Esp32BaseWeb::sendPageTitle("Zones", "6 路水路配置");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& zone = ZoneConfigStore::get(zoneId);
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        Esp32BaseWeb::beginPanel("Zone 配置");
        Esp32BaseWeb::sendChunk("<h3>");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</h3><div class='tablewrap'><table class='kv'><tbody><tr><th>阀门 GPIO</th><td>");
        writeUInt(zone.valvePin);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>Flow</th><td>Flow ");
        writeUInt(zone.flowId);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>状态</th><td>");
        Esp32BaseWeb::writeHtmlEscaped(Irrigation::zoneStateName(status.state));
        Esp32BaseWeb::sendChunk("</td></tr></tbody></table></div>");
        beginPostForm("/api/v1/zones/config", "确认保存 Zone 配置？", "/irrigation/zones", true);
        writeHiddenUInt("zoneId", zoneId);
        Esp32BaseWeb::sendChunk("<input type='hidden' name='enabledPresent' value='1'><div class='fieldgrid'>");
        writeTextField("名称", "name", zone.name, "med");
        writeCheckboxField("启用", "enabled", zone.enabled);
        writeFlowSelectField(zone.flowId);
        Esp32BaseWeb::sendChunk("</div><div class='actions'>");
        writeSubmit("保存基础配置");
        Esp32BaseWeb::sendChunk("</div></form>");
        beginPostForm("/api/v1/zones/baseline/pending/save", "确认保存 Zone 基线为 pending？", "/irrigation/zones", true);
        writeHiddenUInt("zoneId", zoneId);
        Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
        writeNumberField("正常流量(ml/min)", "learnedFlowMlPerMin", static_cast<int32_t>(zone.activeBaseline.learnedFlowMlPerMin), "med");
        writeNumberField("低阈值(permille)", "lowFlowPermille", zone.activeBaseline.lowFlowPermille, "med");
        writeNumberField("高阈值(permille)", "highFlowPermille", zone.activeBaseline.highFlowPermille, "med");
        writeNumberField("异常确认秒", "flowFaultConfirmSec", zone.activeBaseline.flowFaultConfirmSec, "med");
        writeNumberField("无脉冲超时秒", "noPulseTimeoutSec", zone.activeBaseline.noPulseTimeoutSec, "med");
        Esp32BaseWeb::sendChunk("</div><div class='actions'>");
        writeSubmit("保存基线 pending", "secondary");
        Esp32BaseWeb::sendChunk("</div></form><div class='actions'>");
        beginPostForm("/api/v1/zones/baseline/pending/apply", "确认应用 pending 基线？", "/irrigation/zones");
        writeHiddenUInt("zoneId", zoneId);
        writeSubmit("应用 pending", "secondary");
        Esp32BaseWeb::sendChunk("</form>");
        beginPostForm("/api/v1/zones/baseline/rollback/restore", "确认回滚上一套基线？", "/irrigation/zones");
        writeHiddenUInt("zoneId", zoneId);
        writeSubmit("回滚", "secondary");
        Esp32BaseWeb::sendChunk("</form></div>");
        Esp32BaseWeb::endPanel();
    }
    Esp32BaseWeb::sendFooter();
}

void handleCalibrationPage() {
    Esp32BaseWeb::sendHeader("Calibration");
    Esp32BaseWeb::sendPageTitle("Calibration", "Flow K+Offset 校准");
    Esp32BaseWeb::beginPanel("采样");
    beginPostForm("/api/v1/calibration/start", "确认开始校准采样？", "/irrigation/calibration", true);
    Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
    writeNumberField("Zone", "zoneId", 1, "short");
    Esp32BaseWeb::sendChunk("</div><div class='actions'>");
    writeSubmit("开始采样");
    Esp32BaseWeb::sendChunk("</div></form><div class='actions'>");
    beginPostForm("/api/v1/calibration/stop", "确认停止采样？", "/irrigation/calibration");
    writeSubmit("停止采样", "secondary");
    Esp32BaseWeb::sendChunk("</form></div>");
    beginPostForm("/api/v1/calibration/sample", "确认提交实际接水量？", "/irrigation/calibration", true);
    Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
    writeNumberField("实际水量(ml)", "actualMl", 1000, "med");
    Esp32BaseWeb::sendChunk("</div><div class='actions'>");
    writeSubmit("提交样本");
    Esp32BaseWeb::sendChunk("</div></form><div class='actions'>");
    beginPostForm("/api/v1/calibration/pending/save", "确认保存推荐值为 pending？", "/irrigation/calibration");
    writeSubmit("保存推荐 pending", "secondary");
    Esp32BaseWeb::sendChunk("</form></div>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleSettingsPage() {
    const Irrigation::SystemConfig& config = SystemConfigStore::current();
    Esp32BaseWeb::sendHeader("Settings");
    Esp32BaseWeb::sendPageTitle("Settings", "灌溉系统参数");
    Esp32BaseWeb::beginPanel("系统配置");
    beginPostForm("/api/v1/config", "确认保存系统配置？", "/irrigation/settings", true);
    Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
    writeNumberField("最长浇水秒", "maxWateringDurationSec", static_cast<int32_t>(config.maxWateringDurationSec), "med");
    writeNumberField("手动默认秒", "manualDefaultDurationSec", static_cast<int32_t>(config.manualDefaultDurationSec), "med");
    writeNumberField("计划宽限秒", "scheduleGraceSec", config.scheduleGraceSec, "med");
    writeNumberField("排队最大秒", "queuedPlanMaxDelaySec", config.queuedPlanMaxDelaySec, "med");
    writeNumberField("待机漏水窗口秒", "idleLeakWindowSec", config.idleLeakWindowSec, "med");
    writeNumberField("待机漏水脉冲", "idleLeakPulseThreshold", config.idleLeakPulseThreshold, "med");
    Esp32BaseWeb::sendChunk("</div><div class='actions'>");
    writeSubmit("保存");
    Esp32BaseWeb::sendChunk("</div></form>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handlePlansPage() {
    uint32_t defaultYmd = 20260605UL;
    (void)PlanStore::currentYmd(&defaultYmd);
    uint8_t selectedZoneId = 0;
    uint8_t selectedSlotIndex = 0;
    const bool editingSlot = readZoneId(&selectedZoneId) &&
                             readU8("slotIndex", &selectedSlotIndex) &&
                             selectedSlotIndex < Irrigation::MaxPlansPerZone;
    Esp32BaseWeb::sendHeader("Plans");
    Esp32BaseWeb::sendPageTitle("Plans", "每个 Zone 最多 6 条计划");
    if (editingSlot) {
        const Irrigation::PlanDefinition& selectedPlan = PlanStore::getBySlot(selectedZoneId, selectedSlotIndex);
        Esp32BaseWeb::beginPanel("编辑计划");
        Esp32BaseWeb::sendChunk("<h3>Zone ");
        writeUInt(selectedZoneId);
        Esp32BaseWeb::sendChunk(" / Slot ");
        writeUInt(selectedSlotIndex + 1);
        Esp32BaseWeb::sendChunk("</h3>");
        writePlanEditForm(selectedZoneId, selectedPlan, defaultYmd);
        Esp32BaseWeb::sendChunk("<div class='actions'><a class='btnlink secondary' href='/irrigation/plans'>返回计划列表</a></div>");
        Esp32BaseWeb::endPanel();
    }
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        Esp32BaseWeb::beginPanel("Zone 计划");
        Esp32BaseWeb::sendChunk("<h3>Zone ");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("</h3><div class='tablewrap'><table class='part'><thead><tr><th>Slot</th><th>计划</th><th>启用</th><th>时间</th><th>时长</th><th>循环</th><th>操作</th></tr></thead><tbody>");
        for (uint8_t slot = 0; slot < Irrigation::MaxPlansPerZone; ++slot) {
            const Irrigation::PlanDefinition& plan = PlanStore::getBySlot(zoneId, slot);
            Esp32BaseWeb::sendChunk("<tr><td>");
            writeUInt(slot + 1);
            Esp32BaseWeb::sendChunk("</td><td>");
            if (plan.exists) {
                Esp32BaseWeb::writeHtmlEscaped(plan.name);
            } else {
                Esp32BaseWeb::sendChunk("-");
            }
            Esp32BaseWeb::sendChunk("</td><td>");
            Esp32BaseWeb::sendChunk(plan.exists && plan.enabled ? "yes" : "no");
            Esp32BaseWeb::sendChunk("</td><td>");
            if (plan.exists) {
                writeTimeText(plan.timeHour, plan.timeMinute);
            } else {
                Esp32BaseWeb::sendChunk("-");
            }
            Esp32BaseWeb::sendChunk("</td><td>");
            writeUInt(plan.exists ? plan.durationSec : 300);
            Esp32BaseWeb::sendChunk(" s</td><td>");
            writeUInt(plan.exists ? plan.cycleDays : 1);
            Esp32BaseWeb::sendChunk(" d</td><td><a class='btnlink compact' href='/irrigation/plans?zoneId=");
            writeUInt(zoneId);
            Esp32BaseWeb::sendChunk("&amp;slotIndex=");
            writeUInt(slot);
            Esp32BaseWeb::sendChunk("'>");
            Esp32BaseWeb::sendChunk(plan.exists ? "编辑" : "新建");
            Esp32BaseWeb::sendChunk("</a></td></tr>");
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div>");
        Esp32BaseWeb::endPanel();
    }
    Esp32BaseWeb::sendFooter();
}

struct RecordJsonState {
    bool first;
};

