tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void sendRecordJsonCallback(const RecordStore::WateringRecord& record, void* user) {
    RecordJsonState* state = static_cast<RecordJsonState*>(user);
    if (!state->first) {
        Esp32BaseWeb::sendChunk(",");
    }
    state->first = false;
    writeRecordJson(record);
}

void handleRecordsPage() {
    Esp32BaseWeb::sendHeader("Records");
    Esp32BaseWeb::sendPageTitle("Records", "最近浇水记录");
    Esp32BaseWeb::beginPanel("记录");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>ID</th><th>Zone</th><th>Flow</th><th>结果</th><th>目标</th><th>水量</th><th>开始</th><th>结束</th></tr></thead><tbody>");
    struct PageState {
        bool any;
    } state = {false};
    auto callback = [](const RecordStore::WateringRecord& record, void* user) {
        PageState* s = static_cast<PageState*>(user);
        s->any = true;
        Esp32BaseWeb::sendChunk("<tr><td>");
        writeUInt(record.recordId);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(record.zoneId);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(record.configSnapshot.flowId);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(record.result);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(record.targetSec);
        Esp32BaseWeb::sendChunk(" s</td><td>");
        writeUInt(record.estimatedMilliliters);
        Esp32BaseWeb::sendChunk(" ml</td><td>");
        writeUInt(record.startedEpoch);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(record.endedEpoch);
        Esp32BaseWeb::sendChunk("</td></tr>");
    };
    (void)RecordStore::readLatest(0, 50, callback, &state);
    if (!state.any) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='8'>暂无记录</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleEventsPage() {
    Esp32BaseWeb::sendHeader("Events");
    Esp32BaseWeb::sendPageTitle("Events", "灌溉业务事件");
    Esp32BaseWeb::beginPanel("事件");
    Esp32BaseWeb::sendChunk("<p>业务事件写入 Esp32Base App Events，不另建第二套事件存储。</p><p><a href='/app/events?source=web'>查看 Web 事件</a> <a href='/app/events?source=monitor'>查看监控事件</a> <a href='/app/events?source=schedule'>查看计划事件</a></p>");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>ID</th><th>Level</th><th>Source</th><th>Type</th><th>Reason</th><th>Object</th><th>Text</th></tr></thead><tbody>");
    struct EventPageState {
        bool any;
    } state = {false};
    auto callback = [](const Esp32BaseAppEventRecord& event, void* user) {
        EventPageState* s = static_cast<EventPageState*>(user);
        if (strncmp(event.object, "zone:", 5) != 0 &&
            strncmp(event.object, "flow:", 5) != 0 &&
            strncmp(event.object, "plan:", 5) != 0 &&
            strncmp(event.object, "system:irrigation", 17) != 0 &&
            strncmp(event.object, "config:", 7) != 0) {
            return;
        }
        s->any = true;
        Esp32BaseWeb::sendChunk("<tr><td>");
        writeUInt(event.id);
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(Esp32BaseAppEventLog::levelName(static_cast<Esp32BaseAppEventLog::Level>(event.level)));
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(event.source);
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(event.type);
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(event.reason);
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(event.object);
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(event.text);
        Esp32BaseWeb::sendChunk("</td></tr>");
    };
    (void)Esp32BaseAppEventLog::readLatest(0, 80, callback, &state);
    if (!state.any) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='7'>暂无业务事件</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleStatusApi() {
    Esp32BaseWeb::beginResponse(200, "application/json", nullptr);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"zones\":[");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        if (zoneId > 1) {
            Esp32BaseWeb::sendChunk(",");
        }
        writeStatusJson(ZoneManager::status(zoneId));
    }
    Esp32BaseWeb::sendChunk("],\"zoneConfigs\":[");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        if (zoneId > 1) {
            Esp32BaseWeb::sendChunk(",");
        }
        writeZoneConfigJson(ZoneConfigStore::get(zoneId));
    }
    Esp32BaseWeb::sendChunk("],\"flowConfigs\":[");
    for (uint8_t flowId = 1; flowId <= Irrigation::MaxFlowMeters; ++flowId) {
        if (flowId > 1) {
            Esp32BaseWeb::sendChunk(",");
        }
        writeFlowConfigJson(FlowConfigStore::get(flowId));
    }
    Esp32BaseWeb::sendChunk("],\"flowAlerts\":[");
    for (uint8_t flowId = 1; flowId <= Irrigation::MaxFlowMeters; ++flowId) {
        if (flowId > 1) {
            Esp32BaseWeb::sendChunk(",");
        }
        const FlowAlertStore::FlowAlert& alert = FlowAlertStore::get(flowId);
        Esp32BaseWeb::sendChunk("{\"flowId\":");
        writeUInt(flowId);
        Esp32BaseWeb::sendChunk(",\"idleLeakActive\":");
        writeBool(alert.idleLeakActive);
        Esp32BaseWeb::sendChunk(",\"observedPulses\":");
        writeUInt(alert.observedPulses);
        Esp32BaseWeb::sendChunk(",\"pulseThreshold\":");
        writeUInt(alert.pulseThreshold);
        Esp32BaseWeb::sendChunk(",\"windowSec\":");
        writeUInt(alert.windowSec);
        Esp32BaseWeb::sendChunk("}");
    }
    Esp32BaseWeb::sendChunk("]}");
    Esp32BaseWeb::endResponse();
}

void handlePlansApi() {
    Esp32BaseWeb::beginResponse(200, "application/json", nullptr);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"plans\":[");
    bool first = true;
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        for (uint8_t slot = 0; slot < Irrigation::MaxPlansPerZone; ++slot) {
            const Irrigation::PlanDefinition& plan = PlanStore::getBySlot(zoneId, slot);
            if (!first) {
                Esp32BaseWeb::sendChunk(",");
            }
            first = false;
            writePlanJson(plan);
        }
    }
    Esp32BaseWeb::sendChunk("]}");
    Esp32BaseWeb::endResponse();
}

void handlePlanSaveApi() {
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone_id");
        return;
    }
    uint32_t planId = 0;
    Irrigation::PlanDefinition plan = {};
    const bool updating = Esp32BaseWeb::hasParam("planId") && readU32("planId", &planId) && planId != 0;
    uint8_t slotIndex = 0;
    const bool slotSubmitted = Esp32BaseWeb::hasParam("slotIndex");
    if (!updating && slotSubmitted && (!readU8("slotIndex", &slotIndex) || slotIndex >= Irrigation::MaxPlansPerZone)) {
        sendError(400, "invalid_slot_index");
        return;
    }
    const bool creatingAtSlot = !updating && slotSubmitted;
    if (updating) {
        if (!PlanStore::getById(planId, &plan) || plan.zoneId != zoneId) {
            sendError(404, "plan_not_found");
            return;
        }
    } else {
        plan.exists = true;
        plan.zoneId = zoneId;
        plan.enabled = false;
        plan.timeHour = 7;
        plan.timeMinute = 0;
        plan.durationSec = 300;
        plan.cycleDays = 1;
        plan.cycleMask = 1;
        if (!PlanStore::currentYmd(&plan.cycleStartYmd)) {
            plan.cycleStartYmd = 20260605UL;
        }
    }
    if (Esp32BaseWeb::hasParam("name")) {
        char name[Irrigation::NameMaxBytes];
        if (!getParamText("name", name, sizeof(name))) {
            sendError(400, "invalid_name");
            return;
        }
        strlcpy(plan.name, name, sizeof(plan.name));
    }
    if (Esp32BaseWeb::hasParam("enabledPresent") || Esp32BaseWeb::hasParam("enabled")) {
        plan.enabled = readCheckbox("enabled");
    }
    if (Esp32BaseWeb::hasParam("timeHour") && !readU8("timeHour", &plan.timeHour)) {
        sendError(400, "invalid_hour");
        return;
    }
    if (Esp32BaseWeb::hasParam("timeMinute") && !readU8("timeMinute", &plan.timeMinute)) {
        sendError(400, "invalid_minute");
        return;
    }
    if (Esp32BaseWeb::hasParam("durationSec") && !readU32("durationSec", &plan.durationSec)) {
        sendError(400, "invalid_duration");
        return;
    }
    if (Esp32BaseWeb::hasParam("cycleDays") && !readU8("cycleDays", &plan.cycleDays)) {
        sendError(400, "invalid_cycle_days");
        return;
    }
    if (Esp32BaseWeb::hasParam("cycleMask") && !readU32("cycleMask", &plan.cycleMask)) {
        sendError(400, "invalid_cycle_mask");
        return;
    }
    if (Esp32BaseWeb::hasParam("cycleStartYmd") && !readU32("cycleStartYmd", &plan.cycleStartYmd)) {
        sendError(400, "invalid_cycle_start");
        return;
    }
    const Irrigation::ZoneConfig& zone = ZoneConfigStore::get(zoneId);
    if (plan.enabled && (!zone.enabled || !FlowConfigStore::get(zone.flowId).enabled)) {
        sendError(409, "zone_or_flow_disabled");
        return;
    }
    Irrigation::PlanDefinition saved = {};
    if (updating) {
        if (!PlanStore::set(plan.planId, plan)) {
            sendError(400, "plan_rejected");
            return;
        }
        saved = plan;
    } else if (creatingAtSlot ? !PlanStore::createAt(zoneId, slotIndex, plan, &saved) : !PlanStore::create(zoneId, plan, &saved)) {
        sendError(400, "plan_create_rejected");
        return;
    }
    char redirect[80];
    if (redirectRequested(redirect, sizeof(redirect))) {
        Esp32BaseWeb::redirectSeeOther(redirect);
        return;
    }
    Esp32BaseWeb::beginResponse(200, "application/json", nullptr);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"plan\":");
    writePlanJson(saved);
    Esp32BaseWeb::sendChunk("}");
    Esp32BaseWeb::endResponse();
}

void handlePlanDeleteApi() {
    uint32_t planId = 0;
    if (!readU32("planId", &planId) || planId == 0) {
        sendError(400, "invalid_plan_id");
        return;
    }
    if (!PlanStore::remove(planId)) {
        sendError(404, "plan_not_found");
        return;
    }
    sendOkOrRedirect();
}

void handleRecordsApi() {
    RecordJsonState state = {true};
    Esp32BaseWeb::beginResponse(200, "application/json", nullptr);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"count\":");
    writeUInt(RecordStore::count());
    Esp32BaseWeb::sendChunk(",\"records\":[");
    (void)RecordStore::readLatest(0, 50, sendRecordJsonCallback, &state);
    Esp32BaseWeb::sendChunk("]}");
    Esp32BaseWeb::endResponse();
}

struct EventJsonState {
    bool first;
};

