tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void handleCalibrationStopApi() {
    if (!FlowCalibration::stop()) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    sendOkOrRedirect();
}

void handleCalibrationSampleApi() {
    uint32_t actualMl = 0;
    if (!readU32("actualMl", &actualMl) || actualMl == 0) {
        sendError(400, "invalid_actual_ml");
        return;
    }
    if (!FlowCalibration::submitActualMilliliters(actualMl)) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    sendOkOrRedirect();
}

void handleCalibrationSavePendingApi() {
    if (!FlowCalibration::saveCandidate()) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    sendOkOrRedirect();
}

void handleCalibrationApplyApi() {
    uint8_t flowId = 0;
    if (!readFlowId(&flowId)) {
        sendError(400, "invalid_flow_id");
        return;
    }
    if (ZoneManager::isFlowBusy(flowId)) {
        sendError(409, "flow_running");
        return;
    }
    Irrigation::FlowMeterCalibrationProfile oldProfile = {};
    Irrigation::FlowMeterCalibrationProfile newProfile = {};
    if (!FlowConfigStore::applyPendingCalibration(flowId, &oldProfile, &newProfile)) {
        sendError(409, "apply_pending_failed");
        return;
    }
    BusinessEventLog::appendFlowCalibrationApplied(flowId, oldProfile, newProfile, "web");
    sendOkOrRedirect();
}

void handleCalibrationRestoreApi() {
    uint8_t flowId = 0;
    if (!readFlowId(&flowId)) {
        sendError(400, "invalid_flow_id");
        return;
    }
    if (ZoneManager::isFlowBusy(flowId)) {
        sendError(409, "flow_running");
        return;
    }
    Irrigation::FlowMeterCalibrationProfile oldProfile = {};
    Irrigation::FlowMeterCalibrationProfile restoredProfile = {};
    if (!FlowConfigStore::restoreRollbackCalibration(flowId, &oldProfile, &restoredProfile)) {
        sendError(409, "restore_rollback_failed");
        return;
    }
    BusinessEventLog::appendFlowCalibrationRestored(flowId, oldProfile, restoredProfile, "web");
    sendOkOrRedirect();
}

void handleConfigApi() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        const Irrigation::SystemConfig& config = SystemConfigStore::current();
        Esp32BaseWeb::beginResponse(200, "application/json", nullptr);
        Esp32BaseWeb::sendChunk("{\"ok\":true,\"maxWateringDurationSec\":");
        writeUInt(config.maxWateringDurationSec);
        Esp32BaseWeb::sendChunk(",\"scheduleGraceSec\":");
        writeUInt(config.scheduleGraceSec);
        Esp32BaseWeb::sendChunk(",\"queuedPlanMaxDelaySec\":");
        writeUInt(config.queuedPlanMaxDelaySec);
        Esp32BaseWeb::sendChunk(",\"manualDefaultDurationSec\":");
        writeUInt(config.manualDefaultDurationSec);
        Esp32BaseWeb::sendChunk(",\"idleLeakWindowSec\":");
        writeUInt(config.idleLeakWindowSec);
        Esp32BaseWeb::sendChunk(",\"idleLeakPulseThreshold\":");
        writeUInt(config.idleLeakPulseThreshold);
        Esp32BaseWeb::sendChunk("}");
        Esp32BaseWeb::endResponse();
        return;
    }
    Irrigation::SystemConfig config = SystemConfigStore::current();
    if (Esp32BaseWeb::hasParam("maxWateringDurationSec") && !readU32("maxWateringDurationSec", &config.maxWateringDurationSec)) {
        sendError(400, "invalid_max_duration");
        return;
    }
    if (Esp32BaseWeb::hasParam("scheduleGraceSec") && !readU16("scheduleGraceSec", &config.scheduleGraceSec)) {
        sendError(400, "invalid_schedule_grace");
        return;
    }
    if (Esp32BaseWeb::hasParam("queuedPlanMaxDelaySec") && !readU16("queuedPlanMaxDelaySec", &config.queuedPlanMaxDelaySec)) {
        sendError(400, "invalid_queue_delay");
        return;
    }
    if (Esp32BaseWeb::hasParam("manualDefaultDurationSec") && !readU32("manualDefaultDurationSec", &config.manualDefaultDurationSec)) {
        sendError(400, "invalid_manual_default");
        return;
    }
    if (Esp32BaseWeb::hasParam("idleLeakWindowSec") && !readU16("idleLeakWindowSec", &config.idleLeakWindowSec)) {
        sendError(400, "invalid_idle_leak_window");
        return;
    }
    if (Esp32BaseWeb::hasParam("idleLeakPulseThreshold") && !readU16("idleLeakPulseThreshold", &config.idleLeakPulseThreshold)) {
        sendError(400, "invalid_idle_leak_pulse");
        return;
    }
    if (!SystemConfigStore::set(config)) {
        sendError(400, "system_config_rejected");
        return;
    }
    sendOkOrRedirect();
}

}

namespace IrrigationWeb {

void begin() {
    (void)Esp32BaseWeb::addNavItem("/irrigation", "灌溉");
    (void)Esp32BaseWeb::addNavItem("/irrigation/zones", "水路");
    (void)Esp32BaseWeb::addNavItem("/irrigation/flows", "流量计");
    (void)Esp32BaseWeb::addNavItem("/irrigation/plans", "计划");
    (void)Esp32BaseWeb::addNavItem("/irrigation/calibration", "校准");
    (void)Esp32BaseWeb::addNavItem("/irrigation/records", "记录");
    (void)Esp32BaseWeb::addNavItem("/irrigation/events", "事件");
    (void)Esp32BaseWeb::addNavItem("/irrigation/settings", "灌溉设置");
    const bool ok =
        Esp32BaseWeb::addRoute("/irrigation", Esp32BaseWeb::METHOD_GET, handleIndexPage) &&
        Esp32BaseWeb::addRoute("/irrigation/zones", Esp32BaseWeb::METHOD_GET, handleZonesPage) &&
        Esp32BaseWeb::addRoute("/irrigation/flows", Esp32BaseWeb::METHOD_GET, handleFlowsPage) &&
        Esp32BaseWeb::addRoute("/irrigation/plans", Esp32BaseWeb::METHOD_GET, handlePlansPage) &&
        Esp32BaseWeb::addRoute("/irrigation/calibration", Esp32BaseWeb::METHOD_GET, handleCalibrationPage) &&
        Esp32BaseWeb::addRoute("/irrigation/records", Esp32BaseWeb::METHOD_GET, handleRecordsPage) &&
        Esp32BaseWeb::addRoute("/irrigation/events", Esp32BaseWeb::METHOD_GET, handleEventsPage) &&
        Esp32BaseWeb::addRoute("/irrigation/settings", Esp32BaseWeb::METHOD_GET, handleSettingsPage) &&
        Esp32BaseWeb::addRoute("/index", Esp32BaseWeb::METHOD_GET, handleIndexPage) &&
        Esp32BaseWeb::addRoute("/api/v1/status", Esp32BaseWeb::METHOD_GET, handleStatusApi) &&
        Esp32BaseWeb::addRoute("/api/v1/plans", Esp32BaseWeb::METHOD_GET, handlePlansApi) &&
        Esp32BaseWeb::addRoute("/api/v1/plans/save", Esp32BaseWeb::METHOD_POST, handlePlanSaveApi) &&
        Esp32BaseWeb::addRoute("/api/v1/plans/delete", Esp32BaseWeb::METHOD_POST, handlePlanDeleteApi) &&
        Esp32BaseWeb::addRoute("/api/v1/records", Esp32BaseWeb::METHOD_GET, handleRecordsApi) &&
        Esp32BaseWeb::addRoute("/api/v1/events", Esp32BaseWeb::METHOD_GET, handleEventsApi) &&
        Esp32BaseWeb::addRoute("/api/v1/manual/start", Esp32BaseWeb::METHOD_POST, handleManualStartApi) &&
        Esp32BaseWeb::addRoute("/api/v1/manual/stop", Esp32BaseWeb::METHOD_POST, handleManualStopApi) &&
        Esp32BaseWeb::addRoute("/api/v1/manual/stop-all", Esp32BaseWeb::METHOD_POST, handleStopAllApi) &&
        Esp32BaseWeb::addRoute("/api/v1/zones/config", Esp32BaseWeb::METHOD_POST, handleZoneConfigApi) &&
        Esp32BaseWeb::addRoute("/api/v1/zones/baseline/pending/save", Esp32BaseWeb::METHOD_POST, handleZoneBaselineSavePendingApi) &&
        Esp32BaseWeb::addRoute("/api/v1/zones/baseline/pending/apply", Esp32BaseWeb::METHOD_POST, handleZoneBaselineApplyApi) &&
        Esp32BaseWeb::addRoute("/api/v1/zones/baseline/rollback/restore", Esp32BaseWeb::METHOD_POST, handleZoneBaselineRestoreApi) &&
        Esp32BaseWeb::addRoute("/api/v1/flows/config", Esp32BaseWeb::METHOD_POST, handleFlowConfigApi) &&
        Esp32BaseWeb::addRoute("/api/v1/calibration/start", Esp32BaseWeb::METHOD_POST, handleCalibrationStartApi) &&
        Esp32BaseWeb::addRoute("/api/v1/calibration/stop", Esp32BaseWeb::METHOD_POST, handleCalibrationStopApi) &&
        Esp32BaseWeb::addRoute("/api/v1/calibration/sample", Esp32BaseWeb::METHOD_POST, handleCalibrationSampleApi) &&
        Esp32BaseWeb::addRoute("/api/v1/calibration/pending/save", Esp32BaseWeb::METHOD_POST, handleCalibrationSavePendingApi) &&
        Esp32BaseWeb::addRoute("/api/v1/calibration/pending/apply", Esp32BaseWeb::METHOD_POST, handleCalibrationApplyApi) &&
        Esp32BaseWeb::addRoute("/api/v1/calibration/rollback/restore", Esp32BaseWeb::METHOD_POST, handleCalibrationRestoreApi) &&
        Esp32BaseWeb::addRoute("/api/v1/config", Esp32BaseWeb::METHOD_GET, handleConfigApi) &&
        Esp32BaseWeb::addRoute("/api/v1/config", Esp32BaseWeb::METHOD_POST, handleConfigApi);
    if (!ok) {
        BusinessEventLog::appendWebRouteRegistrationFailed(1);
    }
}

}
